results/call_storm_report_20250509_130030/statistics.json
{
  "01 - Connect" : {
    "transaction" : "01 - Connect",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 56.775,
    "medianResTime" : 54.0,
    "minResTime" : 49.0,
    "maxResTime" : 99.0,
    "pct1ResTime" : 69.0,
    "pct2ResTime" : 72.94999999999999,
    "pct3ResTime" : 96.4799999999999,
    "throughput" : 6.105938024729048,
    "receivedKBytesPerSec" : 0.7692050831934056,
    "sentKBytesPerSec" : 0.942127156159365
  },
  "Select Receiver Target" : {
    "transaction" : "Select Receiver Target",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.933333333333331,
    "medianResTime" : 7.0,
    "minResTime" : 4.0,
    "maxResTime" : 135.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 23.99000000000001,
    "throughput" : 5.2797381249890005,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "03 - Call Initiated" : {
    "transaction" : "03 - Call Initiated",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.1699999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 5.213854950555276,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.2698577269330367
  },
  "05 - Call Accepted" : {
    "transaction" : "05 - Call Accepted",
    "sampleCount" : 95,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.17894736842105263,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 0.964633490043967,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.06970984205395855
  },
  "Caller - Read Response (Timeout)" : {
    "transaction" : "Caller - Read Response (Timeout)",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.19999999999999998,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 0.5103472913317513,
    "receivedKBytesPerSec" : 0.03289347776161678,
    "sentKBytesPerSec" : 0.0
  },
  "02 - Register" : {
    "transaction" : "02 - Register",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.19166666666666676,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 6.131521128199887,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.2395125440703081
  },
  "04 - Call Received" : {
    "transaction" : "04 - Call Received",
    "sampleCount" : 1144,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4561.475524475522,
    "medianResTime" : 6000.0,
    "minResTime" : 0.0,
    "maxResTime" : 6015.0,
    "pct1ResTime" : 6002.0,
    "pct2ResTime" : 6008.0,
    "pct3ResTime" : 6013.0,
    "throughput" : 9.46933640148662,
    "receivedKBytesPerSec" : 0.20559295614637738,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2740,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2079.889051094888,
    "medianResTime" : 9.0,
    "minResTime" : 0.0,
    "maxResTime" : 6015.0,
    "pct1ResTime" : 6001.0,
    "pct2ResTime" : 6002.0,
    "pct3ResTime" : 6012.59,
    "throughput" : 22.477809315985496,
    "receivedKBytesPerSec" : 0.5686026303753958,
    "sentKBytesPerSec" : 0.4349259344903116
  },
  "Caller - Read Response" : {
    "transaction" : "Caller - Read Response",
    "sampleCount" : 108,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 444.5185185185184,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 6001.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 6000.0,
    "pct3ResTime" : 6001.0,
    "throughput" : 1.958295557570263,
    "receivedKBytesPerSec" : 0.2630432626926564,
    "sentKBytesPerSec" : 0.0
  },
  "Caller - Read Response (User Busy)" : {
    "transaction" : "Caller - Read Response (User Busy)",
    "sampleCount" : 87,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.02298850574712644,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.9183277473981302,
    "receivedKBytesPerSec" : 0.10490854868583525,
    "sentKBytesPerSec" : 0.0
  },
  "07 - Call Ended" : {
    "transaction" : "07 - Call Ended",
    "sampleCount" : 93,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.20430107526881727,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.0598290598290598,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.06727430555555555
  },
  "06 - Call Rejected" : {
    "transaction" : "06 - Call Rejected",
    "sampleCount" : 21,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.19047619047619047,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 0.28556276261575486,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.020636371517154164
  },
  "Caller - Read Response (Ping Handled)" : {
    "transaction" : "Caller - Read Response (Ping Handled)",
    "sampleCount" : 34,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 223.61764705882348,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 2661.0,
    "pct1ResTime" : 1355.0,
    "pct2ResTime" : 2337.0,
    "pct3ResTime" : 2661.0,
    "throughput" : 1.2705055864877994,
    "receivedKBytesPerSec" : 0.04714766824857068,
    "sentKBytesPerSec" : 0.0
  },
  "Process Call Decision" : {
    "transaction" : "Process Call Decision",
    "sampleCount" : 127,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.69291338582677,
    "medianResTime" : 9.0,
    "minResTime" : 5.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 14.200000000000003,
    "pct2ResTime" : 25.799999999999955,
    "pct3ResTime" : 48.47999999999999,
    "throughput" : 1.2884375412147837,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Caller - Read Response (Target Unavailable)" : {
    "transaction" : "Caller - Read Response (Target Unavailable)",
    "sampleCount" : 51,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.05882352941176472,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 1.1365409043299979,
    "receivedKBytesPerSec" : 0.06881400006685535,
    "sentKBytesPerSec" : 0.0
  },
  "04 - Call Received (Ping Handled)" : {
    "transaction" : "04 - Call Received (Ping Handled)",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3452.358333333333,
    "medianResTime" : 3951.0,
    "minResTime" : 0.0,
    "maxResTime" : 5989.0,
    "pct1ResTime" : 5986.0,
    "pct2ResTime" : 5988.0,
    "pct3ResTime" : 5989.0,
    "throughput" : 1.6647013941874178,
    "receivedKBytesPerSec" : 0.06177602829992371,
    "sentKBytesPerSec" : 0.0
  }
}